quote.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://ragone.io/rss.xml"
      title="RSS feed for https://ragone.io/"/>
<title>quotes.el</title>
<meta  name="author" content="ragone" />
      <link href= "static/style.css" rel="stylesheet" type="text/css" />
      <link href= "static/htmlize.css" rel="stylesheet" type="text/css" />
      <meta http-equiv="content-type" content="application/xhtml+xml; charset=UTF-8" />
      <meta name="viewport" content="initial-scale=1,width=device-width,minimum-scale=1"></head>
<body>
<div id="preamble" class="status">
<div class="header">
        <a href="https://ragone.io">Alex Ragone</a> - Find me on <a title="LinkedIn" href="https://www.linkedin.com/in/alex-ragone" target="_blank" rel="noopener">LinkedIn</a> or <a title="Github" href="https://github.com/ragone" target="_blank" rel="noopener">Github</a>!
      </div></div>
<div id="content">
<div class="headline"> <h1 class="post-title"><a href="quote.html">quotes.el</a></h1>
<div class="taglist">:<a href="https://ragone.io/tag-emacs.html">emacs</a>:<a href="https://ragone.io/tag-snippets.html">snippets</a>:</div></div><p>
My initial buffer displays a random quote from a list of programming/CS quotes.
The complete list of quotes can be found <a href="https://ragone.io/static/quotes.txt">here</a>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defvar</span> <span class="org-variable-name">ragone-quotes-file</span> <span class="org-string">"~/.doom.d/quotes.txt"</span>
  <span class="org-doc">"File to lookup quotes."</span><span class="org-parinfer-pretty-parensXdim-paren">)</span>

(<span class="org-keyword">defvar</span> <span class="org-variable-name">ragone-quotes-file-seperator-regex</span> <span class="org-string">"\n%\n"</span>
  <span class="org-doc">"Delimiter for seperating the line in `</span><span class="org-doc"><span class="org-constant">ragone-quotes-file</span></span><span class="org-doc">'."</span><span class="org-parinfer-pretty-parensXdim-paren">)</span>

(<span class="org-keyword">defvar</span> <span class="org-variable-name">ragone-quotes-author-regex</span> <span class="org-string">"^--"</span>
  <span class="org-doc">"Regex for getting the author of the quote.</span>

<span class="org-doc">Anything after this will be changed to face `</span><span class="org-doc"><span class="org-constant">font-lock-comment-face</span></span><span class="org-doc">'."</span><span class="org-parinfer-pretty-parensXdim-paren">)</span>

(<span class="org-keyword">defun</span> <span class="org-function-name">ragone-get-quote</span> (<span class="org-type">&amp;optional</span> nth<span class="org-parinfer-pretty-parensXdim-paren">)</span>
  <span class="org-doc">"Get a random quote from `</span><span class="org-doc"><span class="org-constant">ragone-quotes-file</span></span><span class="org-doc">'.</span>

<span class="org-doc">Optionally get the NTH quote."</span>
  (<span class="org-keyword">let*</span> ((quotes (<span class="org-function-name">split-string</span>
                  (<span class="org-keyword">with-temp-buffer</span>
                    (<span class="org-constant">insert-file-contents</span> <span class="org-variable-name">ragone-quotes-file</span><span class="org-parinfer-pretty-parensXdim-paren">)</span>
                    (<span class="org-constant">buffer-substring-no-properties</span>
                     (<span class="org-constant">point-min</span><span class="org-parinfer-pretty-parensXdim-paren">)</span>
                     (<span class="org-constant">point-max</span><span class="org-parinfer-pretty-parensXdim-paren">)))</span>
                  <span class="org-variable-name">ragone-quotes-file-seperator-regex</span> t<span class="org-parinfer-pretty-parensXdim-paren">))</span>
         (selected-quote (<span class="org-constant">nth</span> (<span class="org-keyword">or</span> nth
                                  (<span class="org-constant">random</span> (<span class="org-constant">length</span> quotes<span class="org-parinfer-pretty-parensXdim-paren">)))</span>
                              quotes<span class="org-parinfer-pretty-parensXdim-paren">)))</span>
    (<span class="org-constant">put-text-property</span>
     (<span class="org-constant">string-match</span> <span class="org-variable-name">ragone-quotes-author-regex</span> selected-quote<span class="org-parinfer-pretty-parensXdim-paren">)</span>
     (<span class="org-constant">length</span> selected-quote<span class="org-parinfer-pretty-parensXdim-paren">)</span>
     <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">face</span>
     <span class="org-highlight-quoted-quote">'</span><span class="org-variable-name">font-lock-comment-face</span>
     selected-quote<span class="org-parinfer-pretty-parensXdim-paren">)</span>
    selected-quote<span class="org-parinfer-pretty-parensXdim-paren">))</span>

<span class="org-comment-delimiter">;; </span><span class="org-comment">Update your scratch buffer</span>
(<span class="org-keyword">setq</span> <span class="org-variable-name">initial-scratch-message</span> (ragone-get-quote<span class="org-parinfer-pretty-parensXdim-paren">))</span>
</pre>
</div>
</div>
<div id="postamble" class="status"><div id="archive">
        <a href="archive.html">archive</a>
      </div></div>
</body>
</html>
